t21/Walnut_X/Packages/.cache/Keil.STM32L0xx_DFP.1.6.0.pdsc
          <variant Dvariant="STM32L011E4Yx"> <feature type="CSP" n="25"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011F3'  ***************************** -->
        <device Dname="STM32L011F3">
          <memory id="IROM1"                        start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <variant Dvariant="STM32L011F3Px"> <feature type="SOP" n="20"/> </variant>
          <variant Dvariant="STM32L011F3Ux"> <feature type="QFN" n="20"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011F4'  ***************************** -->
        <device Dname="STM32L011F4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L011F4Px"> <feature type="SOP" n="20"/> </variant>
          <variant Dvariant="STM32L011F4Ux"> <feature type="QFN" n="20"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011G3'  ***************************** -->
        <device Dname="STM32L011G3">
          <memory id="IROM1"                        start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <variant Dvariant="STM32L011G3Ux"> <feature type="QFN" n="28"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011G4'  ***************************** -->
        <device Dname="STM32L011G4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L011G4Ux"> <feature type="QFN" n="28"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011K3'  ***************************** -->
        <device Dname="STM32L011K3">
          <memory id="IROM1"                        start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <variant Dvariant="STM32L011K3Tx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L011K3Ux"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011K4'  ***************************** -->
        <device Dname="STM32L011K4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L011K4Tx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L011K4Ux"> <feature type="QFN" n="32"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L021'  **************************** -->
      <subFamily DsubFamily="STM32L021">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L021xx"/>
        <debug svd="SVD/STM32L0x1.svd"/>
        <algorithm name="Flash/STM32L01_2x_EEPROM.FLM" start="0x08080000" size="0x00000200" default="0"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>
        <book name="Documents/DM00206858.pdf" title="STM32L021xx Data Sheet"/>

        <!-- *************************  Device 'STM32L021D4'  ***************************** -->
        <device Dname="STM32L021D4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L021D4Px"> <feature type="SOP" n="13"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L021F4'  ***************************** -->
        <device Dname="STM32L021F4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L021F4Px"> <feature type="SOP" n="20"/> </variant>
          <variant Dvariant="STM32L021F4Ux"> <feature type="QFN" n="20"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L021G4'  ***************************** -->
        <device Dname="STM32L021G4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L021G4Ux"> <feature type="QFN" n="28"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L021K4'  ***************************** -->
        <device Dname="STM32L021K4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

