t21/Walnut_X/Packages/.cache/Keil.STM32L0xx_DFP.1.6.0.pdsc
          <variant Dvariant="STM32L021K4Tx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L021K4Ux"> <feature type="QFN" n="32"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L031'  **************************** -->
      <subFamily DsubFamily="STM32L031">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L031xx"/>
        <debug svd="SVD/STM32L0x1.svd"/>
        <algorithm name="Flash/STM32L03_4x_EEPROM.FLM" start="0x08080000" size="0x00000400" default="0"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>
        <book name="Documents/DM00140359.pdf" title="STM32L031xx Data Sheet"/>

        <!-- *************************  Device 'STM32L031C4'  ***************************** -->
        <device Dname="STM32L031C4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L031C4Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031C6'  ***************************** -->
        <device Dname="STM32L031C6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L031C6Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031E4'  ***************************** -->
        <device Dname="STM32L031E4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L031E4Yx"> <feature type="CSP" n="25"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031E6'  ***************************** -->
        <device Dname="STM32L031E6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L031E6Yx"> <feature type="CSP" n="25"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031F4'  ***************************** -->
        <device Dname="STM32L031F4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L031F4Px"> <feature type="SOP" n="20"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031F6'  ***************************** -->
        <device Dname="STM32L031F6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L031F6Px"> <feature type="SOP" n="20"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031G4'  ***************************** -->
        <device Dname="STM32L031G4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L031G4Ux"> <feature type="QFN" n="28"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031G6'  ***************************** -->
        <device Dname="STM32L031G6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L031G6Ux"> <feature type="QFN" n="28"/> </variant>
          <variant Dvariant="STM32L031G6UxS"> <feature type="QFN" n="28"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031K4'  ***************************** -->
        <device Dname="STM32L031K4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

