t21/Walnut_X/Packages/.cache/Keil.STM32L0xx_DFP.1.6.0.pdsc
          <variant Dvariant="STM32L031K4Tx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L031K4Ux"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031K6'  ***************************** -->
        <device Dname="STM32L031K6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L031K6Tx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L031K6Ux"> <feature type="QFN" n="32"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L041'  **************************** -->
      <subFamily DsubFamily="STM32L041">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L041xx"/>
        <debug svd="SVD/STM32L0x1.svd"/>
        <algorithm name="Flash/STM32L03_4x_EEPROM.FLM" start="0x08080000" size="0x00000400" default="0"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>
        <book name="Documents/DM00152023.pdf" title="STM32L041xx Data Sheet"/>

        <!-- *************************  Device 'STM32L041C4'  ***************************** -->
        <device Dname="STM32L041C4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L041C4Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L041C6'  ***************************** -->
        <device Dname="STM32L041C6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L041C6Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L041F6'  ***************************** -->
        <device Dname="STM32L041F6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L041F6Px"> <feature type="SOP" n="20"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L041G6'  ***************************** -->
        <device Dname="STM32L041G6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L041G6Ux"> <feature type="QFN" n="28"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L041K6'  ***************************** -->
        <device Dname="STM32L041K6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L041K6Tx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L041K6Ux"> <feature type="QFN" n="32"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L051'  **************************** -->
      <subFamily DsubFamily="STM32L051">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L051xx"/>
        <debug svd="SVD/STM32L051x.svd"/>
        <algorithm name="Flash/STM32L05_6x_EEPROM.FLM" start="0x08080000" size="0x00000800" default="0"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>
        <book name="Documents/DM00108219.pdf" title="STM32L051xx Data Sheet"/>

        <feature type="SPI"           n="2"       m="16000000"/>

        <!-- *************************  Device 'STM32L051C6'  ***************************** -->
        <device Dname="STM32L051C6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>

