t21/Walnut_X/Packages/.cache/Keil.STM32L0xx_DFP.1.6.0.pdsc
          <variant Dvariant="STM32L071CZTx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32L071CZYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L071K8'  ***************************** -->
        <device Dname="STM32L071K8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L07x_64_EEPROM.FLM" start="0x08080C00" size="0x00000800"             default="0"/>

          <variant Dvariant="STM32L071K8Ux"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L071KB'  ***************************** -->
        <device Dname="STM32L071KB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L071KBTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L071KBUx"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L071KZ'  ***************************** -->
        <device Dname="STM32L071KZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L071KZTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L071KZUx"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L071RB'  ***************************** -->
        <device Dname="STM32L071RB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L071RBHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L071RBTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L071RZ'  ***************************** -->
        <device Dname="STM32L071RZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L071RZHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L071RZTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L071V8'  ***************************** -->
        <device Dname="STM32L071V8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L07x_64_EEPROM.FLM" start="0x08080C00" size="0x00000800"             default="0"/>

          <variant Dvariant="STM32L071V8Ix"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L071V8Tx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L071VB'  ***************************** -->
        <device Dname="STM32L071VB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L071VBIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L071VBTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L071VZ'  ***************************** -->
        <device Dname="STM32L071VZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L071VZIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L071VZTx"> <feature type="QFP" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L072'  **************************** -->
      <subFamily DsubFamily="STM32L072">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L072xx"/>
        <debug svd="SVD/STM32L07x.svd"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"    start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108281.pdf" title="STM32L0x2 Reference Manual"/>
        <book name="Documents/DM00141133.pdf" title="STM32L072xx Data Sheet"/>

        <!-- *************************  Device 'STM32L072CB'  ***************************** -->
        <device Dname="STM32L072CB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072CBTx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32L072CBYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072CZ'  ***************************** -->
        <device Dname="STM32L072CZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072CZTx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32L072CZYx"> <feature type="CSP" n="49"/> </variant>
          <variant Dvariant="STM32L072CZEx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072KB'  ***************************** -->
        <device Dname="STM32L072KB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072KBTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L072KBUx"> <feature type="QFN" n="32"/> </variant>
        </device>

