t21/Walnut_X/Packages/.cache/Keil.STM32L0xx_DFP.1.6.0.pdsc
        <!-- *************************  Device 'STM32L072KZ'  ***************************** -->
        <device Dname="STM32L072KZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072KZTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L072KZUx"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072RB'  ***************************** -->
        <device Dname="STM32L072RB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072RBHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L072RBIx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L072RBTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072RZ'  ***************************** -->
        <device Dname="STM32L072RZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072RZHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L072RZIx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L072RZTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072V8'  ***************************** -->
        <device Dname="STM32L072V8">
          <memory id="IROM1"                               start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"         start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L07x_64_EEPROM.FLM"  start="0x08080C00" size="0x00000800"             default="0"/>

          <variant Dvariant="STM32L072V8Ix"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L072V8Tx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072VB'  ***************************** -->
        <device Dname="STM32L072VB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072VBIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L072VBTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072VZ'  ***************************** -->
        <device Dname="STM32L072VZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072VZIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L072VZTx"> <feature type="QFP" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L073'  **************************** -->
      <subFamily DsubFamily="STM32L073">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L073xx"/>
        <debug svd="SVD/STM32L07x.svd"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"    start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00095744.pdf" title="STM32L0x3 Reference Manual"/>
        <book name="Documents/DM00141036.pdf" title="STM32L073xx Data Sheet"/>

        <!-- *************************  Device 'STM32L073CB'  ***************************** -->
        <device Dname="STM32L073CB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073CBTx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L073CZ'  ***************************** -->
        <device Dname="STM32L073CZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073CZTx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L073RB'  ***************************** -->
        <device Dname="STM32L073RB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073RBHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L073RBTx"> <feature type="QFP" n="64"/> </variant>
        </device>

