t21/Walnut_X/Packages/.cache/Keil.STM32L0xx_DFP.1.6.0.pdsc
        <!-- *************************  Device 'STM32L073RZ'  ***************************** -->
        <device Dname="STM32L073RZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073RZHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L073RZTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L073V8'  ***************************** -->
        <device Dname="STM32L073V8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L07x_64_EEPROM.FLM" start="0x08080C00" size="0x00000800"             default="0"/>

          <variant Dvariant="STM32L073V8Ix"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L073V8Tx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L073VB'  ***************************** -->
        <device Dname="STM32L073VB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073VBIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L073VBTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L073VZ'  ***************************** -->
        <device Dname="STM32L073VZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073VZIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L073VZTx"> <feature type="QFP" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L081'  **************************** -->
      <subFamily DsubFamily="STM32L081">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L081xx"/>
        <debug svd="SVD/STM32L0x1.svd"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"    start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108281.pdf" title="STM32L0x1 Reference Manual"/>
        <book name="Documents/DM00162467.pdf" title="STM32L081xx Data Sheet"/>

        <!-- *************************  Device 'STM32L081CZ'  ***************************** -->
        <device Dname="STM32L081CZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L081CZTx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L081KZ'  ***************************** -->
        <device Dname="STM32L081KZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L081KZTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L081KZUx"> <feature type="QFN" n="32"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L082'  **************************** -->
      <subFamily DsubFamily="STM32L082">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L082xx"/>
        <debug svd="SVD/STM32L07x.svd"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"        start="0x1FF80000" size="0x00000014" default="0"/>
        <algorithm name="Flash/STM32L07_8x_EEPROM.FLM"   start="0x08080000" size="0x00001800" default="0"/>

        <book name="Documents/DM00108281.pdf" title="STM32L0x2 Reference Manual"/>
        <book name="Documents/DM00141132.pdf" title="STM32L082xx Data Sheet"/>

        <!-- *************************  Device 'STM32L082KB'  ***************************** -->
        <device Dname="STM32L082KB">
          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>

          <variant Dvariant="STM32L082KBTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L082KBUx"> <feature type="QFN" n="32"/> </variant>
        </device>

