t21/Walnut_X/Packages/.cache/Keil.STM32L0xx_DFP.1.6.0.pdsc
        <!-- *************************  Device 'STM32L082KZ'  ***************************** -->
        <device Dname="STM32L082KZ">
          <memory id="IROM1"                        start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM" start="0x08000000" size="0x00030000"             default="1"/>

          <variant Dvariant="STM32L082KZTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L082KZUx"> <feature type="QFN" n="32"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L083'  **************************** -->
      <subFamily DsubFamily="STM32L083">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L083xx"/>
        <debug svd="SVD/STM32L07x.svd"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"    start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00095744.pdf" title="STM32L0x3 Reference Manual"/>
        <book name="Documents/DM00140762.pdf" title="STM32L083xx Data Sheet"/>

        <!-- *************************  Device 'STM32L083CB'  ***************************** -->
        <device Dname="STM32L083CB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L083CBTx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L083CZ'  ***************************** -->
        <device Dname="STM32L083CZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L083CZTx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L083RB'  ***************************** -->
        <device Dname="STM32L083RB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L083RBHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L083RBTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L083RZ'  ***************************** -->
        <device Dname="STM32L083RZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L083RZHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L083RZTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L083V8'  ***************************** -->
        <device Dname="STM32L083V8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L07x_64_EEPROM.FLM" start="0x08080C00" size="0x00000800"             default="0"/>

          <variant Dvariant="STM32L083V8Ix"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L083V8Tx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L083VB'  ***************************** -->
        <device Dname="STM32L083VB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L083VBIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L083VBTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L083VZ'  ***************************** -->
        <device Dname="STM32L083VZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

